Tekla Open API Reference for Tekla Structures 2025
ComponentItem Properties
The ComponentItem type exposes the following members.
Properties
Name | Description
AttributeFileExtension
 Gets the attribute file extension of item from the component database.
Name
 The component item's internal name which is used by Tekla Structures in component identification.
Number
 The component item's internal number which is used by Tekla Structures in component identification.
Type
 The component item's type.
UIName
 The component item's name which is visible in the Tekla Structures user interface.
Top
See Also
Reference
ComponentItem Class
Tekla.Structures.Catalogs Namespace